[
    {
        
        "image": "https://i.ibb.co/5T4X1Zw/johannes-w-IQKu-Hc2lils-unsplash.jpg",
        "room_title": "Luxury Haven Suite",
        "description": "Escape to the breathtaking landscapes of Luxury Haven Resort. Nestled amidst lush greenery and overlooking serene blue waters, our resort offers unparalleled luxury and relaxation.",
        "room_code": "101"
    },
    {
        
        "image": "https://i.ibb.co/nnCCkrt/tony-yakovlenko-l-Dxxe-AJr-Wp-E-unsplash.jpg",
        "room_title": "Sunset Paradise Villa",
        "description": "Experience the ultimate beachfront getaway at Sunset Paradise Hotel. Enjoy stunning sunsets, white sandy beaches, and world-class amenities that cater to your every need.",
        "room_code": "102"
    },
    {
        
        "image": "https://i.ibb.co/rF2FLN8/abigail-keenan-l2-Jp-NQF-q-Dc-unsplash.jpg",
        "room_title": "Mountain Retreat Cabin",
        "description": "Indulge in a tranquil mountain escape at Mountain Retreat Lodge. Surrounded by majestic peaks and pristine forests, our lodge offers a cozy sanctuary for nature lovers.",
        "room_code": "103"
    },
    {
        
        "image": "https://i.ibb.co/J5rt6NT/nik-lanus-YMOHw3-F1-Hdk-unsplash.jpg",
        "room_title": "Urban Oasis Deluxe Room",
        "description": "Discover an urban oasis at Urban Oasis Hotel. Located in the heart of the city, our hotel combines modern sophistication with exceptional comfort for an unforgettable stay.",
        "room_code": "104"
    },
    {
        
        "image": "https://i.ibb.co/HtNWHV3/indoors-4234071-1280.jpg",
        "room_title": "Garden View Villa",
        "description": "Relax in privacy and tranquility in our Garden View Villa. Surrounded by lush greenery and blooming flowers, this villa offers a peaceful retreat away from the hustle and bustle of daily life.",
        "room_code": "201"
    },
    {
        
        "image": "https://i.ibb.co/1MTqCqs/bed-4416515-1280.jpg",
        "room_title": "Beachfront Bungalow",
        "description": "Step out of your door and onto the sandy shores with our Beachfront Bungalow. Perfect for beach lovers, this cozy bungalow offers direct access to the beach and stunning views of the sunset.",
        "room_code": "202"
    },
    {
        
        "image": "https://i.ibb.co/Fsmf8zd/bedroom-1285156-1280.jpg",
        "room_title": "Penthouse Suite",
        "description": "Experience the height of luxury in our Penthouse Suite. This expansive suite features floor-to-ceiling windows, a private terrace, and unparalleled views of the city skyline.",
        "room_code": "203"
    },
    {
        
        "image": "https://i.ibb.co/J7r6NgM/hotel-1749602-1280.jpg",
        "room_title": "Riverside Cabin",
        "description": "Embrace nature and tranquility in our Riverside Cabin. Situated along the banks of a serene river, this cozy cabin offers a peaceful escape surrounded by towering trees and the sounds of nature.",
        "room_code": "204"
    },
    {
        
        "image": "https://i.ibb.co/fk2b9kt/bedroom-3475656-1280.jpg",
        "room_title": "Family Suite",
        "description": "Create lasting memories with your loved ones in our Family Suite. With ample space and thoughtful amenities, this suite is perfect for families looking for a comfortable and convenient stay.",
        "room_code": "301"
    },
    {
        
        "image": "https://i.ibb.co/7Wd8Ct7/bedroom-5664221-1280.jpg",
        "room_title": "Safari Tent",
        "description": "Experience the thrill of camping without sacrificing comfort in our Safari Tent. Tucked away in the heart of the wilderness, this tent offers a cozy retreat after a day of adventure.",
        "room_code": "302"
    },
    {
        
        "image": "https://i.ibb.co/PtVHQmt/hotel-room-1447201-1280.jpg",
        "room_title": "Skyline View Loft",
        "description": "Enjoy panoramic views of the city skyline in our Skyline View Loft. With its contemporary design and spacious layout, this loft is perfect for urban adventurers.",
        "room_code": "303"
    },
    {
        
        "image": "https://i.ibb.co/R4rB7gL/room-2269594-1280.jpg",
        "room_title": "Lakefront Cabin",
        "description": "Escape to the serenity of the lake in our Lakefront Cabin. Nestled along the shore, this cozy cabin offers stunning views of the lake and easy access to water activities.",
        "room_code": "304"
    },
    {
        
        "image": "https://i.ibb.co/fGg0xTR/to-travel-1677347-1280.jpg",
        "room_title": "Classic Double Room",
        "description": "Experience comfort and convenience in our Classic Double Room. Ideal for couples or solo travelers, this room offers all the essential amenities for a pleasant stay.",
        "room_code": "401"
    },
    {
        
        "image": "https://i.ibb.co/1KwwKfb/bedroom-1330846-1280.jpg",
        "room_title": "Forest View Cottage",
        "description": "Immerse yourself in nature with our Forest View Cottage. Surrounded by towering trees and chirping birds, this cozy cottage offers a peaceful retreat away from the hustle and bustle of city life.",
        "room_code": "402"
    },
    {
        
        "image": "https://i.ibb.co/D8bcH8S/hotel-1979406-1280.jpg",
        "room_title": "Urban Studio",
        "description": "Experience city living at its finest in our Urban Studio. With its modern design and convenient location, this studio is perfect for solo travelers or couples exploring the city.",
        "room_code": "403"
    },
    {
        
        "image": "https://i.ibb.co/HnMsM7X/living-room-4809587-1280.jpg",
        "room_title": "Charming Cottage",
        "description": "Escape the hustle and bustle of daily life in our Charming Cottage. Tucked away in a quaint village, this cottage offers a cozy retreat with all the comforts of home.",
        "room_code": "404"
    }
]